load-tests/scenarios/auction-bid-random.yml
# Random bid load test – stress validation & rejection behavior

config:
  target: "http://localhost:5091"
  processor: "../scripts/helpers.js"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "warm-up"
    - duration: 60
      arrivalRate: 20
      name: "ramp-up"
    - duration: 120
      arrivalRate: 50
      name: "peak"

scenarios:
  - name: "Random bids — POST /test/bid"
    beforeScenario: "setAuctionIdFromEnv"
    flow:
      - function: "setRandomTestBidAmount"
      - post:
          url: "/test/bid"
          headers:
            Content-Type: "application/json"
          json:
            auctionId: "{{ auctionId }}"
            amount: "{{ amount }}"
      - think: 0.2