load-tests/scenarios/auction-mixed.yml
# Designed and Implemented by Amin Ghaderi
#
# Mixed workload: create auction, load static test UI (join simulation), SignalR negotiate.

config:
  target: "http://localhost:5091"
  processor: "../scripts/helpers.js"
  phases:
    - duration: 30
      arrivalRate: 1
      name: "warm-up"
    - duration: 60
      arrivalRate: 5
      name: "ramp-up"
    - duration: 120
      arrivalRate: 20
      name: "peak"

scenarios:
  - name: "Mixed — create, static client, negotiate"
    flow:
      - function: "setCreatePayload"
      - post:
          url: "/auctions"
          headers:
            Content-Type: "application/json"
          json:
            startPrice: "{{ startPrice }}"
            durationSeconds: "{{ durationSeconds }}"
      - get:
          url: "/index.html"
      - post:
          url: "/auctionHub/negotiate?negotiateVersion=1"
          headers:
            Content-Type: "application/json"
          json: {}